zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEray_regdef.h
/** \brief Message Buffer Status Changed Interrupt Control 4 */
typedef struct _Ifx_ERAY_MSIC4_Bits
{
    Ifx_UReg_32Bit MSIP96:1;          /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointer 96 (n = 96-127) - MSIP96 (rw) */
    Ifx_UReg_32Bit MSIP97:1;          /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointer 97 (n = 96-127) - MSIP97 (rw) */
    Ifx_UReg_32Bit MSIP98:1;          /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointer 98 (n = 96-127) - MSIP98 (rw) */
    Ifx_UReg_32Bit MSIP99:1;          /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointer 99 (n = 96-127) - MSIP99 (rw) */
    Ifx_UReg_32Bit MSIP100:1;         /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointer 100 (n = 96-127) - MSIP100 (rw) */
    Ifx_UReg_32Bit MSIP101:1;         /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointer 101 (n = 96-127) - MSIP101 (rw) */
    Ifx_UReg_32Bit MSIP102:1;         /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointer 102 (n = 96-127) - MSIP102 (rw) */
    Ifx_UReg_32Bit MSIP103:1;         /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointer 103 (n = 96-127) - MSIP103 (rw) */
    Ifx_UReg_32Bit MSIP104:1;         /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointer 104 (n = 96-127) - MSIP104 (rw) */
    Ifx_UReg_32Bit MSIP105:1;         /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointer 105 (n = 96-127) - MSIP105 (rw) */
    Ifx_UReg_32Bit MSIP106:1;         /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointer 106 (n = 96-127) - MSIP106 (rw) */
    Ifx_UReg_32Bit MSIP107:1;         /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointer 107 (n = 96-127) - MSIP107 (rw) */
    Ifx_UReg_32Bit MSIP108:1;         /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointer 108 (n = 96-127) - MSIP108 (rw) */
    Ifx_UReg_32Bit MSIP109:1;         /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointer 109 (n = 96-127) - MSIP109 (rw) */
    Ifx_UReg_32Bit MSIP110:1;         /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointer 110 (n = 96-127) - MSIP110 (rw) */
    Ifx_UReg_32Bit MSIP111:1;         /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointer 111 (n = 96-127) - MSIP111 (rw) */
    Ifx_UReg_32Bit MSIP112:1;         /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointer 112 (n = 96-127) - MSIP112 (rw) */
    Ifx_UReg_32Bit MSIP113:1;         /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointer 113 (n = 96-127) - MSIP113 (rw) */
    Ifx_UReg_32Bit MSIP114:1;         /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointer 114 (n = 96-127) - MSIP114 (rw) */
    Ifx_UReg_32Bit MSIP115:1;         /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointer 115 (n = 96-127) - MSIP115 (rw) */
    Ifx_UReg_32Bit MSIP116:1;         /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointer 116 (n = 96-127) - MSIP116 (rw) */
    Ifx_UReg_32Bit MSIP117:1;         /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointer 117 (n = 96-127) - MSIP117 (rw) */
    Ifx_UReg_32Bit MSIP118:1;         /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointer 118 (n = 96-127) - MSIP118 (rw) */
    Ifx_UReg_32Bit MSIP119:1;         /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointer 119 (n = 96-127) - MSIP119 (rw) */
    Ifx_UReg_32Bit MSIP120:1;         /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointer 120 (n = 96-127) - MSIP120 (rw) */
    Ifx_UReg_32Bit MSIP121:1;         /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointer 121 (n = 96-127) - MSIP121 (rw) */
    Ifx_UReg_32Bit MSIP122:1;         /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointer 122 (n = 96-127) - MSIP122 (rw) */
    Ifx_UReg_32Bit MSIP123:1;         /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointer 123 (n = 96-127) - MSIP123 (rw) */
    Ifx_UReg_32Bit MSIP124:1;         /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointer 124 (n = 96-127) - MSIP124 (rw) */
    Ifx_UReg_32Bit MSIP125:1;         /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointer 125 (n = 96-127) - MSIP125 (rw) */
    Ifx_UReg_32Bit MSIP126:1;         /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointer 126 (n = 96-127) - MSIP126 (rw) */
    Ifx_UReg_32Bit MSIP127:1;         /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointer 127 (n = 96-127) - MSIP127 (rw) */
} Ifx_ERAY_MSIC4_Bits;

/** \brief Macrotick and Cycle Counter Value */
typedef struct _Ifx_ERAY_MTCCV_Bits
{
    Ifx_UReg_32Bit MTV:14;            /**< \brief [13:0] Macrotick Value(vMacrotick) - MTV (rh) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit CCV:6;             /**< \brief [21:16] Cycle Counter Value(vCycleCounter) - CCV (rh) */
    Ifx_UReg_32Bit reserved_22:10;    /**< \brief [31:22] \internal Reserved */
} Ifx_ERAY_MTCCV_Bits;

/** \brief New Data Register 1 */
typedef struct _Ifx_ERAY_NDAT1_Bits
{
    Ifx_UReg_32Bit ND0:1;             /**< \brief [0:0] New Data 0 (n = 0-31) - ND0 (rh) */
    Ifx_UReg_32Bit ND1:1;             /**< \brief [1:1] New Data 1 (n = 0-31) - ND1 (rh) */
    Ifx_UReg_32Bit ND2:1;             /**< \brief [2:2] New Data 2 (n = 0-31) - ND2 (rh) */
    Ifx_UReg_32Bit ND3:1;             /**< \brief [3:3] New Data 3 (n = 0-31) - ND3 (rh) */
    Ifx_UReg_32Bit ND4:1;             /**< \brief [4:4] New Data 4 (n = 0-31) - ND4 (rh) */
    Ifx_UReg_32Bit ND5:1;             /**< \brief [5:5] New Data 5 (n = 0-31) - ND5 (rh) */
    Ifx_UReg_32Bit ND6:1;             /**< \brief [6:6] New Data 6 (n = 0-31) - ND6 (rh) */
    Ifx_UReg_32Bit ND7:1;             /**< \brief [7:7] New Data 7 (n = 0-31) - ND7 (rh) */
    Ifx_UReg_32Bit ND8:1;             /**< \brief [8:8] New Data 8 (n = 0-31) - ND8 (rh) */
    Ifx_UReg_32Bit ND9:1;             /**< \brief [9:9] New Data 9 (n = 0-31) - ND9 (rh) */
    Ifx_UReg_32Bit ND10:1;            /**< \brief [10:10] New Data 10 (n = 0-31) - ND10 (rh) */
    Ifx_UReg_32Bit ND11:1;            /**< \brief [11:11] New Data 11 (n = 0-31) - ND11 (rh) */
    Ifx_UReg_32Bit ND12:1;            /**< \brief [12:12] New Data 12 (n = 0-31) - ND12 (rh) */
    Ifx_UReg_32Bit ND13:1;            /**< \brief [13:13] New Data 13 (n = 0-31) - ND13 (rh) */
    Ifx_UReg_32Bit ND14:1;            /**< \brief [14:14] New Data 14 (n = 0-31) - ND14 (rh) */
    Ifx_UReg_32Bit ND15:1;            /**< \brief [15:15] New Data 15 (n = 0-31) - ND15 (rh) */
    Ifx_UReg_32Bit ND16:1;            /**< \brief [16:16] New Data 16 (n = 0-31) - ND16 (rh) */
    Ifx_UReg_32Bit ND17:1;            /**< \brief [17:17] New Data 17 (n = 0-31) - ND17 (rh) */
    Ifx_UReg_32Bit ND18:1;            /**< \brief [18:18] New Data 18 (n = 0-31) - ND18 (rh) */
    Ifx_UReg_32Bit ND19:1;            /**< \brief [19:19] New Data 19 (n = 0-31) - ND19 (rh) */
    Ifx_UReg_32Bit ND20:1;            /**< \brief [20:20] New Data 20 (n = 0-31) - ND20 (rh) */
    Ifx_UReg_32Bit ND21:1;            /**< \brief [21:21] New Data 21 (n = 0-31) - ND21 (rh) */
    Ifx_UReg_32Bit ND22:1;            /**< \brief [22:22] New Data 22 (n = 0-31) - ND22 (rh) */
    Ifx_UReg_32Bit ND23:1;            /**< \brief [23:23] New Data 23 (n = 0-31) - ND23 (rh) */
    Ifx_UReg_32Bit ND24:1;            /**< \brief [24:24] New Data 24 (n = 0-31) - ND24 (rh) */
    Ifx_UReg_32Bit ND25:1;            /**< \brief [25:25] New Data 25 (n = 0-31) - ND25 (rh) */
    Ifx_UReg_32Bit ND26:1;            /**< \brief [26:26] New Data 26 (n = 0-31) - ND26 (rh) */
    Ifx_UReg_32Bit ND27:1;            /**< \brief [27:27] New Data 27 (n = 0-31) - ND27 (rh) */
    Ifx_UReg_32Bit ND28:1;            /**< \brief [28:28] New Data 28 (n = 0-31) - ND28 (rh) */
    Ifx_UReg_32Bit ND29:1;            /**< \brief [29:29] New Data 29 (n = 0-31) - ND29 (rh) */
    Ifx_UReg_32Bit ND30:1;            /**< \brief [30:30] New Data 30 (n = 0-31) - ND30 (rh) */
    Ifx_UReg_32Bit ND31:1;            /**< \brief [31:31] New Data 31 (n = 0-31) - ND31 (rh) */
} Ifx_ERAY_NDAT1_Bits;

/** \brief New Data Register 2 */
typedef struct _Ifx_ERAY_NDAT2_Bits
{
    Ifx_UReg_32Bit ND32:1;            /**< \brief [0:0] New Data 32 (n = 32-63) - ND32 (rh) */
    Ifx_UReg_32Bit ND33:1;            /**< \brief [1:1] New Data 33 (n = 32-63) - ND33 (rh) */
    Ifx_UReg_32Bit ND34:1;            /**< \brief [2:2] New Data 34 (n = 32-63) - ND34 (rh) */
    Ifx_UReg_32Bit ND35:1;            /**< \brief [3:3] New Data 35 (n = 32-63) - ND35 (rh) */
    Ifx_UReg_32Bit ND36:1;            /**< \brief [4:4] New Data 36 (n = 32-63) - ND36 (rh) */
    Ifx_UReg_32Bit ND37:1;            /**< \brief [5:5] New Data 37 (n = 32-63) - ND37 (rh) */
    Ifx_UReg_32Bit ND38:1;            /**< \brief [6:6] New Data 38 (n = 32-63) - ND38 (rh) */
    Ifx_UReg_32Bit ND39:1;            /**< \brief [7:7] New Data 39 (n = 32-63) - ND39 (rh) */
    Ifx_UReg_32Bit ND40:1;            /**< \brief [8:8] New Data 40 (n = 32-63) - ND40 (rh) */
    Ifx_UReg_32Bit ND41:1;            /**< \brief [9:9] New Data 41 (n = 32-63) - ND41 (rh) */
    Ifx_UReg_32Bit ND42:1;            /**< \brief [10:10] New Data 42 (n = 32-63) - ND42 (rh) */
    Ifx_UReg_32Bit ND43:1;            /**< \brief [11:11] New Data 43 (n = 32-63) - ND43 (rh) */
    Ifx_UReg_32Bit ND44:1;            /**< \brief [12:12] New Data 44 (n = 32-63) - ND44 (rh) */
    Ifx_UReg_32Bit ND45:1;            /**< \brief [13:13] New Data 45 (n = 32-63) - ND45 (rh) */
    Ifx_UReg_32Bit ND46:1;            /**< \brief [14:14] New Data 46 (n = 32-63) - ND46 (rh) */
    Ifx_UReg_32Bit ND47:1;            /**< \brief [15:15] New Data 47 (n = 32-63) - ND47 (rh) */
    Ifx_UReg_32Bit ND48:1;            /**< \brief [16:16] New Data 48 (n = 32-63) - ND48 (rh) */
    Ifx_UReg_32Bit ND49:1;            /**< \brief [17:17] New Data 49 (n = 32-63) - ND49 (rh) */
    Ifx_UReg_32Bit ND50:1;            /**< \brief [18:18] New Data 50 (n = 32-63) - ND50 (rh) */
    Ifx_UReg_32Bit ND51:1;            /**< \brief [19:19] New Data 51 (n = 32-63) - ND51 (rh) */
    Ifx_UReg_32Bit ND52:1;            /**< \brief [20:20] New Data 52 (n = 32-63) - ND52 (rh) */
    Ifx_UReg_32Bit ND53:1;            /**< \brief [21:21] New Data 53 (n = 32-63) - ND53 (rh) */
    Ifx_UReg_32Bit ND54:1;            /**< \brief [22:22] New Data 54 (n = 32-63) - ND54 (rh) */
    Ifx_UReg_32Bit ND55:1;            /**< \brief [23:23] New Data 55 (n = 32-63) - ND55 (rh) */
    Ifx_UReg_32Bit ND56:1;            /**< \brief [24:24] New Data 56 (n = 32-63) - ND56 (rh) */
    Ifx_UReg_32Bit ND57:1;            /**< \brief [25:25] New Data 57 (n = 32-63) - ND57 (rh) */
    Ifx_UReg_32Bit ND58:1;            /**< \brief [26:26] New Data 58 (n = 32-63) - ND58 (rh) */
    Ifx_UReg_32Bit ND59:1;            /**< \brief [27:27] New Data 59 (n = 32-63) - ND59 (rh) */
    Ifx_UReg_32Bit ND60:1;            /**< \brief [28:28] New Data 60 (n = 32-63) - ND60 (rh) */
    Ifx_UReg_32Bit ND61:1;            /**< \brief [29:29] New Data 61 (n = 32-63) - ND61 (rh) */
    Ifx_UReg_32Bit ND62:1;            /**< \brief [30:30] New Data 62 (n = 32-63) - ND62 (rh) */
    Ifx_UReg_32Bit ND63:1;            /**< \brief [31:31] New Data 63 (n = 32-63) - ND63 (rh) */
} Ifx_ERAY_NDAT2_Bits;

